/*Завдання 1
Написати програму, яка складається з наступних дій:
1.Опису підпрограми, що обчислює функцію згідно з варіантом
2.Опису головної програми, що табулює функцію, значення якої обчислюється підпрограмою,
вказаною в п.1 завдання*/

// 1.

#include <iostream>

double func(double x) {
	double y;

	if (x < 0) {
		y = 4 * x * x + 2;
	} else {
		y = 1;

		for (int i = 1; i <= 5; i++) {
			y *= x + (x * x / (i + 1));
		}
		y += x * x;
	}
	return y;
}


// 2.

int main() {
	double y[9];
	int k = 0;
	double h = 0.3;

	for (double і = -5; i <= 4; i += h, k++) {
		y[k] = func(i);
	}
}


